#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ebench/cloud-infra-personnal-website-actions/runs/run-9DsYMRh9bQeBAnHb

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
heroku_pipeline.main_pipeline: Refreshing state... [id=a6cd3be2-5c92-4ceb-971e-7998e25ad5b9]
heroku_pipeline_coupling.coupling_prod: Refreshing state... [id=b6d2e5ed-9140-40c9-aac2-c5d7d7da478e]
heroku_app.app_staging: Refreshing state... [id=ebench-personal-website-dta]
heroku_app.app_prod: Refreshing state... [id=ebench-personal-website-prod]
heroku_pipeline_coupling.coupling_staging: Refreshing state... [id=5f35a64d-5f44-4a26-9a2f-c433df14c0d8]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # heroku_app.app_staging has been changed
  ~ resource "heroku_app" "app_staging" {
      ~ buildpacks            = [
          + "heroku/nodejs",
          + "https://github.com/heroku/heroku-buildpack-static",
        ]
        id                    = "ebench-personal-website-dta"
        name                  = "ebench-personal-website-dta"
        # (11 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # heroku_app.app["dta"] will be created
  + resource "heroku_app" "app" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = {
          + "APP_ENVIRONMENT" = "dta"
        }
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "ebench-personal-website-dta"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_app.app["prod"] will be created
  + resource "heroku_app" "app" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = {
          + "APP_ENVIRONMENT" = "prod"
        }
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "ebench-personal-website-prod"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_app.app_prod will be destroyed
  - resource "heroku_app" "app_prod" {
      - acm                   = false -> null
      - all_config_vars       = (sensitive value)
      - buildpacks            = [] -> null
      - config_vars           = {
          - "APP_ENVIRONMENT" = "prod"
        } -> null
      - git_url               = "https://git.heroku.com/ebench-personal-website-prod.git" -> null
      - heroku_hostname       = "ebench-personal-website-prod.herokuapp.com" -> null
      - id                    = "ebench-personal-website-prod" -> null
      - internal_routing      = false -> null
      - name                  = "ebench-personal-website-prod" -> null
      - region                = "eu" -> null
      - sensitive_config_vars = (sensitive value)
      - stack                 = "heroku-20" -> null
      - uuid                  = "b4f9b70a-e103-43f8-b597-c6b82d66a394" -> null
      - web_url               = "https://ebench-personal-website-prod.herokuapp.com/" -> null
    }

  # heroku_app.app_staging will be destroyed
  - resource "heroku_app" "app_staging" {
      - acm                   = false -> null
      - all_config_vars       = (sensitive value)
      - buildpacks            = [
          - "heroku/nodejs",
          - "https://github.com/heroku/heroku-buildpack-static",
        ] -> null
      - config_vars           = {
          - "APP_ENVIRONMENT" = "staging"
        } -> null
      - git_url               = "https://git.heroku.com/ebench-personal-website-dta.git" -> null
      - heroku_hostname       = "ebench-personal-website-dta.herokuapp.com" -> null
      - id                    = "ebench-personal-website-dta" -> null
      - internal_routing      = false -> null
      - name                  = "ebench-personal-website-dta" -> null
      - region                = "eu" -> null
      - sensitive_config_vars = (sensitive value)
      - stack                 = "heroku-20" -> null
      - uuid                  = "ed26ede5-e88e-4b1e-aeec-0a1d3d8a7348" -> null
      - web_url               = "https://ebench-personal-website-dta.herokuapp.com/" -> null
    }

  # heroku_build.app_build["dta"] will be created
  + resource "heroku_build" "app_build" {
      + app               = (known after apply)
      + buildpacks        = [
          + "heroku/nodejs",
          + "https://github.com/heroku/heroku-buildpack-static",
        ]
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + url      = "https://github.com/heroku/heroku-buildpack-static/archive/refs/tags/v7.tar.gz"
          + version  = "v7"
        }
    }

  # heroku_build.app_build["prod"] will be created
  + resource "heroku_build" "app_build" {
      + app               = (known after apply)
      + buildpacks        = [
          + "heroku/nodejs",
          + "https://github.com/heroku/heroku-buildpack-static",
        ]
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + url      = "https://github.com/heroku/heroku-buildpack-static/archive/refs/tags/v7.tar.gz"
          + version  = "v7"
        }
    }

  # heroku_pipeline_coupling.coupling["dta"] will be created
  + resource "heroku_pipeline_coupling" "coupling" {
      + app      = (known after apply)
      + app_id   = (known after apply)
      + id       = (known after apply)
      + pipeline = "a6cd3be2-5c92-4ceb-971e-7998e25ad5b9"
      + stage    = "staging"
    }

  # heroku_pipeline_coupling.coupling["prod"] will be created
  + resource "heroku_pipeline_coupling" "coupling" {
      + app      = (known after apply)
      + app_id   = (known after apply)
      + id       = (known after apply)
      + pipeline = "a6cd3be2-5c92-4ceb-971e-7998e25ad5b9"
      + stage    = "production"
    }

  # heroku_pipeline_coupling.coupling_prod will be destroyed
  - resource "heroku_pipeline_coupling" "coupling_prod" {
      - app      = "ebench-personal-website-prod" -> null
      - app_id   = "b4f9b70a-e103-43f8-b597-c6b82d66a394" -> null
      - id       = "b6d2e5ed-9140-40c9-aac2-c5d7d7da478e" -> null
      - pipeline = "a6cd3be2-5c92-4ceb-971e-7998e25ad5b9" -> null
      - stage    = "production" -> null
    }

  # heroku_pipeline_coupling.coupling_staging will be destroyed
  - resource "heroku_pipeline_coupling" "coupling_staging" {
      - app      = "ebench-personal-website-dta" -> null
      - app_id   = "ed26ede5-e88e-4b1e-aeec-0a1d3d8a7348" -> null
      - id       = "5f35a64d-5f44-4a26-9a2f-c433df14c0d8" -> null
      - pipeline = "a6cd3be2-5c92-4ceb-971e-7998e25ad5b9" -> null
      - stage    = "staging" -> null
    }

  # heroku_review_app_config.review_app_config will be created
  + resource "heroku_review_app_config" "review_app_config" {
      + automatic_review_apps = true
      + base_name             = "cloud-infra-personal-website"
      + destroy_stale_apps    = true
      + id                    = (known after apply)
      + org_repo              = "elghali97/cloud-infra-personal-website"
      + pipeline_id           = "a6cd3be2-5c92-4ceb-971e-7998e25ad5b9"
      + repo_id               = (known after apply)
      + stale_days            = 5
      + wait_for_ci           = false

      + deploy_target {
          + id   = "eu"
          + type = "region"
        }
    }

Plan: 7 to add, 0 to change, 4 to destroy.


```
</details>
*Pusher: @elghali97, Action: `pull_request`*